{
  "backend/main.mo": "Main ICP actor implementing user profile management, inquiry submission (public), admin credential validation via username/password returning a session access key, and admin-gated inquiry operations (list, mark resolved, delete) protected by that access key.",
  "backend/migration.mo": "Trivial migration module that accepts and returns an empty record, serving as a no-op migration hook for the actor.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features — sessionStorage-based admin login flow and access-key-based admin query hooks — to their respective source files and test IDs.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-sentence descriptions of each frontend source file, serving as a human-readable index of component and hook responsibilities.",
  "frontend/index.css": "Global stylesheet importing Tailwind directives and defining CSS custom properties for the design system's color tokens in both light and dark modes.",
  "frontend/index.html": "HTML entry point for the React app, setting SEO metadata, Open Graph tags, Google Fonts (Playfair Display and Inter), and mounting the root div.",
  "frontend/src/App.tsx": "Defines the TanStack Router setup with all application routes (home, products, quality, global footprint, contact, admin dashboard, admin login) wrapped in a shared Layout shell.",
  "frontend/src/components/CertificationBadge.tsx": "Reusable card component that displays a certification with an icon, name, subtitle badge, description, and optional italicized note, styled with royal-blue and gold accents.",
  "frontend/src/components/FeaturedProductsSlider.tsx": "Horizontally scrollable slider showing the first four products with left/right scroll buttons (desktop only), snap scrolling, and a 'View Details' link per card.",
  "frontend/src/components/Footer.tsx": "Renders the site-wide footer with brand logo, social links (LinkedIn, Instagram), quick navigation links, and contact information including email and phone.",
  "frontend/src/components/InquiriesTable.tsx": "Stub component that previously rendered an inquiries table; the implementation was moved to Admin.tsx, and this file now exports a no-op component to prevent import errors.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with logo, desktop nav links, a 'Request a Quote' CTA button, and a responsive mobile hamburger menu.",
  "frontend/src/components/ProductCard.tsx": "Displays a single rice product card with an image, badge, name, description, and a specifications table showing grain length, moisture content, and purity.",
  "frontend/src/components/RegionCard.tsx": "Card component showing an export region with an icon, region name, covered countries, description, and a highlight badge.",
  "frontend/src/components/WhatsAppButton.tsx": "Fixed floating WhatsApp contact button in the bottom-right corner that links to a specific WhatsApp number.",
  "frontend/src/components/WhyChooseUsCard.tsx": "Simple card component displaying an icon, title, and description for a 'Why Choose Us' feature highlight.",
  "frontend/src/data/products.ts": "Defines the Product and ProductSpec TypeScript interfaces and exports a static array of six rice products (Basmati and Non-Basmati) with specs, badges, and image paths.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous Internet Computer backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useAuth.ts": "Custom hook managing admin authentication state via sessionStorage, providing helpers to check, save, retrieve, and clear an admin access key.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for backend interactions including submitting inquiries, validating admin credentials, fetching inquiries, and marking/deleting inquiries with session-stored access key authorization.",
  "frontend/src/index.css": "Global stylesheet using Tailwind CSS that defines AZAD NEXUS brand CSS custom properties (colors, radius) for light and dark themes, plus utility classes for typography and layout.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with TanStack QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page that displays a table of customer inquiries with options to view details, mark as resolved, and delete, protected by auth state and an admin access key.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page with email/password form that calls the backend validateAdmin mutation and stores the returned access key in session storage on success.",
  "frontend/src/pages/Contact.tsx": "Public contact/inquiry page with a validated form for submitting rice purchase inquiries, showing a success state after successful backend submission.",
  "frontend/src/pages/GlobalFootprint.tsx": "Displays AZAD NEXUS's export market regions (Middle East, Europe, Southeast Asia, Africa) with stats and region cards, plus a CTA section linking to contact and products pages.",
  "frontend/src/pages/Home.tsx": "Landing page featuring a hero section with CTAs, a featured products slider, a 'Why Choose Us' section, and summary stats for the rice export business.",
  "frontend/src/pages/Products.tsx": "Product catalog page with tabbed filtering between Basmati and Non-Basmati rice varieties, rendering product cards from a shared data source.",
  "frontend/src/pages/QualityAssurance.tsx": "Quality assurance page detailing lab testing steps, packaging features, and certifications for AZAD NEXUS rice exports, with a CTA to the contact page.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read, persist, and clear URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom fonts (Playfair Display, Inter), OKLCH-based color tokens (royal, gold, cream, semantic UI colors), custom shadows, border radii, keyframe animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state document tracking the ICP web app's architecture, known issues, existing features, and pending feature requests, primarily focused on replacing Internet Identity with a username/password admin login system backed by a Motoko canister that generates session access keys."
}