{
  "backend/main.mo": "Main Motoko actor for the AZAD NEXUS backend, handling admin authentication with hardcoded credentials, user profile storage, and buyer inquiry submission/retrieval with validation and access control.",
  "feature_evidence.json": "Feature evidence report linking the admin username/password login form feature to its implementing files (Admin.tsx, useQueries.ts) and associated components/test IDs.",
  "frontend-file-summaries.txt": "JSON map of frontend source files to short human-readable summaries describing each component's purpose and notable implementation details.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for the design system's color tokens (background, foreground, primary, chart colors, sidebar, etc.) in both light and dark modes.",
  "frontend/index.html": "HTML shell for the React SPA with SEO meta tags, Open Graph tags, and Google Fonts (Playfair Display + Inter) preloaded for the AZAD NEXUS rice exporter site.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with a shared Layout (Navigation, Footer, WhatsAppButton) and registers all page routes including Home, Products, Quality, GlobalFootprint, Contact, and Admin.",
  "frontend/src/components/CertificationBadge.tsx": "Reusable UI card component that displays a certification with an icon, name, subtitle badge, description, and optional italic note, styled with royal-blue and gold accents.",
  "frontend/src/components/FeaturedProductsSlider.tsx": "Horizontally scrollable slider showing the first 4 products with left/right scroll buttons (desktop only), snap scrolling, and View Details links to the products page.",
  "frontend/src/components/Footer.tsx": "Site-wide footer with the AZAD NEXUS logo, brand description, LinkedIn/Instagram social links, quick navigation links, and contact details including email and address.",
  "frontend/src/components/InquiriesTable.tsx": "Renders a sortable table of rice export inquiries with columns for ID, name, company, country, rice variety, quantity, message, and submission timestamp. Supports ascending/descending sort on any column via clickable headers.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with logo, desktop nav links, a 'Request a Quote' CTA button, and a responsive mobile hamburger menu using TanStack Router for navigation.",
  "frontend/src/components/ProductCard.tsx": "Displays a single rice product card with an image, name, optional badge, description, and a specs table showing grain length, moisture content, and purity.",
  "frontend/src/components/RegionCard.tsx": "Displays an export region card with an icon, region name, covered countries, description, and a highlight badge, styled with a royal-blue header.",
  "frontend/src/components/WhatsAppButton.tsx": "Fixed floating WhatsApp contact button in the bottom-right corner that links to a specific WhatsApp number.",
  "frontend/src/components/WhyChooseUsCard.tsx": "Simple card component displaying an icon, title, and description for a 'Why Choose Us' feature highlight.",
  "frontend/src/data/products.ts": "Defines the Product and ProductSpec TypeScript interfaces and exports a static array of six rice products (basmati and non-basmati) with specs, badges, and image paths.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using TanStack Query, initializing it with an authenticated or anonymous identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, identity persistence, and login status states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for submitting and fetching inquiries, admin authentication, and retrieving the caller's user profile and admin status via the backend actor.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines AZAD NEXUS brand CSS custom properties (colors, radius) for light and dark themes, and adds utility classes for typography and layout.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/Admin.tsx": "Admin page with a login form that authenticates via the backend and, upon success, displays a table of all submitted inquiries with logout and refresh controls.",
  "frontend/src/pages/Contact.tsx": "Contact/quote request page with a validated form for submitting rice export inquiries (name, company, country, variety, quantity, message) using the useSubmitInquiry mutation.",
  "frontend/src/pages/GlobalFootprint.tsx": "Static page showcasing AZAD NEXUS export markets across four regions (Middle East, Europe, Southeast Asia, Africa) with stats and RegionCard components.",
  "frontend/src/pages/Home.tsx": "Landing page featuring a hero section with CTAs, a featured products slider, and a 'Why Choose Us' section highlighting key business stats and value propositions.",
  "frontend/src/pages/Products.tsx": "Products page displaying Basmati and Non-Basmati rice categories in a tabbed layout using ProductCard components sourced from a local data file.",
  "frontend/src/pages/QualityAssurance.tsx": "Quality Assurance page detailing lab testing steps, packaging features, and certifications for AZAD NEXUS rice exports.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom brand color tokens (royal, gold, cream), typography fonts, shadows, animations, and plugin integrations.",
  "project_state.json": "Project state metadata for azadnexus.com tracking existing features, pending admin dashboard feature requests, and hardcoded admin credentials for the buyer inquiries system."
}