{
  "backend/main.mo": "Main Motoko actor for the backend, implementing user profile management, inquiry submission/retrieval, and admin-only access control using a mixin authorization pattern.",
  "feature_evidence.json": "Feature evidence report confirming that the address 'Akurdi near Khandoba Mandir, Pimpri Chinchwad, Pune 411035' was added as plain text to the Contact page.",
  "frontend-file-summaries.txt": "JSON map of frontend source files to short human-readable summaries describing each component's or page's purpose and recent changes.",
  "frontend/index.css": "Global CSS entry point that imports Tailwind layers and defines CSS custom properties for the design system's color tokens in both light and dark modes.",
  "frontend/index.html": "HTML shell for the React SPA, setting SEO meta tags, Open Graph data, Google Fonts (Playfair Display and Inter), and mounting the app at #root.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all page routes (Home, Products, Quality, GlobalFootprint, Contact, Admin) inside a shared Layout with Navigation, Footer, and WhatsAppButton.",
  "frontend/src/components/CertificationBadge.tsx": "Reusable card component that displays a certification with an icon, name, subtitle badge, description, and optional italic note, styled with royal-blue and gold accents.",
  "frontend/src/components/FeaturedProductsSlider.tsx": "Horizontally scrollable slider showing the first four products with left/right scroll buttons (desktop only), product category labels, truncated descriptions, and 'View Details' links.",
  "frontend/src/components/Footer.tsx": "Site-wide footer with the AZAD NEXUS logo, brand description, LinkedIn/Instagram social links, quick navigation links, and contact details including email and address.",
  "frontend/src/components/InquiriesTable.tsx": "Renders a sortable table of rice export inquiries with columns for ID, name, company, country, rice variety, quantity, message, and submission timestamp. Supports ascending/descending sort on any column via clickable headers.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with logo, desktop nav links, a 'Request a Quote' CTA button, and a responsive mobile hamburger menu using TanStack Router for navigation.",
  "frontend/src/components/ProductCard.tsx": "Displays a single rice product card with an image, name, optional badge, description, and a specs table showing grain length, moisture content, and purity.",
  "frontend/src/components/RegionCard.tsx": "Card component displaying an export region with an icon, region name, covered countries, description, and a highlight badge.",
  "frontend/src/components/WhatsAppButton.tsx": "Fixed floating WhatsApp contact button in the bottom-right corner that links to a specific WhatsApp number.",
  "frontend/src/components/WhyChooseUsCard.tsx": "Simple card component displaying an icon, title, and description for a 'Why Choose Us' feature highlight.",
  "frontend/src/data/products.ts": "Defines the Product and ProductSpec TypeScript interfaces and exports a static array of six rice products (basmati and non-basmati) with specs, descriptions, and image paths.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using TanStack Query, supporting both anonymous and authenticated (Internet Identity) actors, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, identity persistence, and login status states for ICP-based authentication.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for submitting and fetching inquiries, retrieving the caller's user profile, and checking admin status via the backend actor.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines AZAD NEXUS brand CSS custom properties (royal blue and gold palette) for light/dark modes, and adds utility classes for typography and layout.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page that handles Internet Identity authentication, verifies admin privileges, and displays an inquiries table with login/access-denied/loading states.",
  "frontend/src/pages/Contact.tsx": "Contact page with a validated inquiry form allowing users to select rice variety, enter quantity and details, and submit via the useSubmitInquiry mutation with a success confirmation state.",
  "frontend/src/pages/GlobalFootprint.tsx": "Static page showcasing AZAD NEXUS export markets across four regions (Middle East, Europe, Southeast Asia, Africa) with stats and region cards.",
  "frontend/src/pages/Home.tsx": "Landing page featuring a hero section with CTAs, company stats, a featured products slider, and a 'Why Choose Us' section.",
  "frontend/src/pages/Products.tsx": "Products page that displays Basmati and Non-Basmati rice categories in a tabbed layout using ProductCard components and filtered product data.",
  "frontend/src/pages/QualityAssurance.tsx": "Quality Assurance page detailing lab testing steps, packaging features, and certifications for AZAD NEXUS rice exports.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read, persist, and clear URL parameters from both query strings and hash-based routes, with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom brand color tokens (royal, gold, cream), typography fonts, shadows, animations, and plugin integrations.",
  "project_state.json": "Project state metadata tracking existing features and a pending request to add a plain-text address to the Contact page."
}