{
  "backend/main.mo": "Main ICP actor implementing user profile management, inquiry submission/retrieval, and a simple admin authentication system using hardcoded credentials and a session access key.",
  "backend/migration.mo": "Migration module that transforms the old actor state to the new shape by dropping the `adminHashedPassword` field while preserving `userProfiles`.",
  "feature_evidence.json": "Empty feature evidence report with no recorded features.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, serving as a reference for the project's frontend component and page structure.",
  "frontend/index.css": "Global stylesheet that imports Tailwind directives and defines CSS custom properties for light and dark theme design tokens (colors, radius, chart, sidebar).",
  "frontend/index.html": "HTML entry point for the AZAD NEXUS app with SEO meta tags, Open Graph tags, Google Fonts (Playfair Display and Inter), and the React root mount point.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with a shared Layout (Navigation, Footer, WhatsApp button) and defines all page routes including admin and admin login.",
  "frontend/src/components/CertificationBadge.tsx": "Reusable UI card component that displays a certification with an icon, name, subtitle, description, and optional italicized note in a bordered, hover-highlighted box.",
  "frontend/src/components/FeaturedProductsSlider.tsx": "Horizontally scrollable slider showing the first 4 products with left/right scroll buttons (desktop only), snap scrolling, and links to the products page.",
  "frontend/src/components/Footer.tsx": "Site-wide footer with the AZAD NEXUS logo, brand description, LinkedIn/Instagram social links, quick navigation links, and contact details.",
  "frontend/src/components/InquiriesTable.tsx": "Stub component kept for import compatibility that renders nothing; the actual inquiry table is implemented directly in Admin.tsx.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with logo, desktop nav links, a 'Request a Quote' CTA button, and a responsive mobile hamburger menu using TanStack Router for active link highlighting.",
  "frontend/src/components/ProductCard.tsx": "Card component that displays a rice product's image, name, badge, description, and a specs table showing grain length, moisture content, and purity.",
  "frontend/src/components/RegionCard.tsx": "Card component displaying an export region with an icon, region name, countries, description, and a highlight badge.",
  "frontend/src/components/WhatsAppButton.tsx": "Fixed floating WhatsApp contact button linking to a specific phone number, positioned at the bottom-right of the screen.",
  "frontend/src/components/WhyChooseUsCard.tsx": "Simple card component rendering an icon, title, and description for a 'Why Choose Us' feature highlight.",
  "frontend/src/data/products.ts": "Defines the Product and ProductSpec TypeScript interfaces and exports a static array of six rice products (basmati and non-basmati) with specs, badges, and image paths.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Simple hook providing admin authentication helpers (check, save, get, and clear an access key) backed by sessionStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity login state, including identity persistence, login/logout, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend interactions: submitting inquiries, validating admin credentials, fetching inquiries, marking resolved, deleting inquiries, and checking admin status.",
  "frontend/src/index.css": "Global stylesheet that imports Tailwind directives and defines AZAD NEXUS brand CSS custom properties (colors, radius, sidebar) for both light and dark themes, plus utility classes for fonts and gold gradient.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider, InternetIdentityProvider, and the root App component.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page that displays a table of customer inquiries with options to view details, mark as resolved, and delete, using React Query hooks for data fetching and mutations.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page with email/password form that validates credentials via the useValidateAdmin mutation and saves an access key on success before redirecting to the admin dashboard.",
  "frontend/src/pages/Contact.tsx": "Contact/inquiry page with a validated form for submitting rice export inquiries (name, company, country, rice category, quantity, contact info) that calls the useSubmitInquiry mutation and shows a success state on completion.",
  "frontend/src/pages/GlobalFootprint.tsx": "Static page showcasing AZAD NEXUS export markets across four regions (Middle East, Europe, Southeast Asia, Africa) with stats, RegionCard components, and a CTA linking to the contact page.",
  "frontend/src/pages/Home.tsx": "Landing page featuring a hero section with CTA buttons, a featured products slider, and a 'Why Choose Us' section, using brand colors and Tailwind styling throughout.",
  "frontend/src/pages/Products.tsx": "React page displaying the full rice product catalog, split into Basmati and Non-Basmati tabs using ProductCard components and filtered product data.",
  "frontend/src/pages/QualityAssurance.tsx": "React page detailing AZAD NEXUS quality assurance processes, including lab testing steps, packaging features, and certification badges.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read, persist, and clear URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom brand color tokens (royal, gold, cream), typography fonts, box shadows, animations, and plugin integrations for the frontend.",
  "project_state.json": "Project state metadata file tracking a pending feature request (AR-1) to update hardcoded backend admin credentials to a new username and password."
}