{
  "backend/main.mo": "Main actor for the ICP backend, combining authorization, blob storage, user profiles, inquiries, blog posts, and services with CRUD operations and admin credential storage.",
  "backend/migration.mo": "Migration module that transforms the old actor state (with a single inquiries map and nextId) into the new actor state that also includes blogPosts and services maps.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (public website, admin login, admin dashboard) to their associated source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document containing short descriptions of each frontend source file, summarizing component behavior, recent changes, and purpose for build planning reference.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property tokens for light and dark themes including colors, radius, chart, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the React app with SEO meta tags, Open Graph tags, Google Fonts (Playfair Display and Inter), and a root div for mounting the app.",
  "frontend/src/App.tsx": "Root React app file that sets up TanStack Router with public and admin layout routes, QueryClientProvider, and registers all page routes including admin management pages.",
  "frontend/src/components/CertificationBadge.tsx": "Reusable UI component that displays a certification entry with an icon, name, subtitle badge, description, and optional italic note in a styled card.",
  "frontend/src/components/FeaturedProductsSlider.tsx": "Horizontal scrollable slider displaying the first 4 featured products with left/right scroll buttons (desktop only) and snap scrolling behavior.",
  "frontend/src/components/Footer.tsx": "Site footer with brand info, social links, quick navigation links, rice variety list, and contact details, rendered on a dark green background.",
  "frontend/src/components/InquiriesTable.tsx": "Sortable data table component that displays a list of customer inquiries with columns for name, company, country, rice variety, quantity, message, and submission timestamp.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with desktop nav links, a 'Request a Quote' CTA button, and a collapsible mobile menu.",
  "frontend/src/components/ProductCard.tsx": "Card component for displaying a rice product with an image, name, description, and a specifications table showing grain length, moisture content, and purity.",
  "frontend/src/components/RegionCard.tsx": "Card component displaying an export region with an icon, region name, countries, description, and a highlight badge.",
  "frontend/src/components/WhatsAppButton.tsx": "Fixed floating WhatsApp chat button anchored to the bottom-right corner of the screen.",
  "frontend/src/components/WhyChooseUsCard.tsx": "Simple card component displaying an icon, title, and description for a 'Why Choose Us' feature highlight.",
  "frontend/src/data/products.ts": "Defines TypeScript interfaces for rice products and exports a static array of six rice product entries (basmati and non-basmati) with specs, descriptions, and image paths.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminAuth.ts": "Custom hook providing admin authentication state and login/logout mutations, using session storage for quick checks and verifying admin status against the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for all backend data operations including submitting/fetching/deleting inquiries and creating/editing/fetching blog posts via the ICP actor.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS, and defines light/dark mode CSS custom properties for the app's color system including gold, green, and cream palettes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity providers wrapping the root App component.",
  "frontend/src/pages/About.tsx": "About page component displaying the company's story, core values, historical milestones, and certifications with a hero section and structured layout sections.",
  "frontend/src/pages/AccessDenied.tsx": "Displays a styled 'Access Denied' page with a shield alert icon, informing the user they must be an admin, and provides links to the admin login and home pages.",
  "frontend/src/pages/Admin.tsx": "Admin page that checks if the caller is an admin via a query hook, shows a loading/denied state if not, and renders an inquiry management dashboard with a stats overview and inquiries table for admins.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard landing page that redirects unauthenticated users to the login page and displays navigation cards for Inquiries, Blog Posts, and Services management with live counts.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page with email/password form that authenticates via the useAdminAuth hook and navigates to the admin dashboard on success, showing inline error messages on failure.",
  "frontend/src/pages/Blog.tsx": "Public blog listing page that fetches and displays blog posts in a card grid with loading skeletons, an empty state, and links to individual post detail pages.",
  "frontend/src/pages/BlogManagement.tsx": "Admin blog management page that lists all blog posts in a table with options to create, edit, and delete posts, redirecting unauthenticated users to the admin login.",
  "frontend/src/pages/BlogPost.tsx": "Displays a single blog post fetched by ID from the URL params, showing a loading skeleton, a not-found state, or the post's title, date, and content.",
  "frontend/src/pages/BlogPostEditor.tsx": "Admin-only form page for creating or editing a blog post, pre-populating fields from an existing post when an ID param is present and redirecting non-admins to the login page.",
  "frontend/src/pages/Contact.tsx": "Contact/quote request page with a form for submitting rice export inquiries, including validation and a success state after submission.",
  "frontend/src/pages/GlobalFootprint.tsx": "Static marketing page showcasing AZAD NEXUS's export regions (Middle East, Europe, Southeast Asia, Africa) with stats and region cards.",
  "frontend/src/pages/Home.tsx": "Landing page featuring a hero banner, company stats, feature highlights, and a grid of featured rice varieties with links to the quote and products pages.",
  "frontend/src/pages/InquiriesManagement.tsx": "Admin-only dashboard page that lists all submitted inquiries with options to delete individual entries or clear all, protected by an admin auth check.",
  "frontend/src/pages/Products.tsx": "Displays the full product catalog page with tabbed navigation separating Basmati and Non-Basmati rice varieties, rendering each product via ProductCard using filtered data from a static products array.",
  "frontend/src/pages/QualityAssurance.tsx": "Renders the Quality Assurance page detailing lab testing steps, packaging features, and certifications for AZAD NEXUS rice exports, using static data with icons and a CertificationBadge component.",
  "frontend/src/pages/ServiceEditor.tsx": "Admin-only form page for editing an existing service entry, fetching the service by ID and submitting updates via the useEditService mutation hook with auth-guard redirect.",
  "frontend/src/pages/Services.tsx": "Public-facing Services page that displays a grid of service/product offerings, merging backend data from useGetServices with default static services as a fallback.",
  "frontend/src/pages/ServicesManagement.tsx": "Admin dashboard page listing all services in a table with edit links, protected by admin auth and populated via the useGetServices query hook.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom design system with green/gold/cream color palettes, custom fonts, shadows, border radii, and keyframe animations for the Azad Nexus Global frontend.",
  "project_state.json": "Project state metadata for Azad Nexus Global, documenting existing features (public website pages, admin login, inquiry dashboard), architectural notes, image requirements, and known issues."
}