{
  "backend/main.mo": "Main Motoko actor for the AZAD NEXUS backend, handling user profile storage with role-based access control and a rice export inquiry submission/retrieval system with admin-only read access.",
  "feature_evidence.json": "A feature evidence report mapping implemented features (multi-page React frontend, corporate design theme, Home page sections) to their corresponding source files, components, and test IDs.",
  "frontend-file-summaries.txt": "A JSON snippet providing a one-line summary of the FeaturedProductsSlider component, noting its scroll button behavior and Tailwind lint fix.",
  "frontend/index.css": "Global CSS entry point that sets up Tailwind directives and defines CSS custom properties for the light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "HTML shell for the AZAD NEXUS React SPA, including SEO meta tags, Open Graph tags, Google Fonts (Playfair Display and Inter), and the root div mount point.",
  "frontend/src/App.tsx": "Defines the TanStack Router configuration with routes for Home, Products, Quality Assurance, Global Footprint, Contact, and Admin pages, wrapped in a shared Layout with Navigation and Footer.",
  "frontend/src/components/CertificationBadge.tsx": "A reusable card component that displays a certification with an icon, name, subtitle, description, and optional italicized note, styled with royal blue and gold accents.",
  "frontend/src/components/FeaturedProductsSlider.tsx": "A horizontally scrollable slider showing the first four products from the products data, with desktop-only left/right scroll buttons and individual product cards linking to the Products page.",
  "frontend/src/components/Footer.tsx": "Site-wide footer component displaying the AZAD NEXUS logo, a brand tagline, quick navigation links, contact details, and a bottom bar with certifications and a caffeine.ai attribution.",
  "frontend/src/components/InquiriesTable.tsx": "Renders a sortable table of rice export inquiries with columns for ID, name, company, country, rice variety, quantity, message, and submission timestamp. Supports ascending/descending sort on any column via clickable headers.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with logo, desktop nav links, a 'Request a Quote' CTA button, and a responsive mobile hamburger menu. Active route is highlighted in gold.",
  "frontend/src/components/ProductCard.tsx": "Displays a single rice product card with a royal-blue header showing the product name and optional badge, plus a specs table listing grain length, moisture content, and purity.",
  "frontend/src/components/RegionCard.tsx": "Card component for displaying an export region with an icon, region name, covered countries, description, and a highlight badge.",
  "frontend/src/components/WhyChooseUsCard.tsx": "Simple card component showing an icon, title, and description for a 'Why Choose Us' feature highlight with hover shadow effect.",
  "frontend/src/data/products.ts": "Defines the Product and ProductSpec TypeScript interfaces and exports a static array of six rice products (basmati and non-basmati) with specs and optional badges.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, identity persistence, and login status states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for submitting and fetching inquiries, retrieving the caller's user profile, and checking admin status via the backend actor.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines AZAD NEXUS brand CSS custom properties (royal blue and gold palette) for light/dark modes, and adds utility classes for typography and layout.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page that handles Internet Identity authentication, verifies admin privileges, and displays an inquiries table with login/access-denied/loading states.",
  "frontend/src/pages/Contact.tsx": "Contact/quote request page with a validated form for submitting rice purchase inquiries, including fields for name, company, country, rice variety, quantity, and message.",
  "frontend/src/pages/GlobalFootprint.tsx": "Static page showcasing AZAD NEXUS export markets across four regions (Middle East, Europe, Southeast Asia, Africa) with stats and region cards.",
  "frontend/src/pages/Home.tsx": "Homepage featuring a hero section with CTAs, a featured products slider, and a 'Why Choose Us' section highlighting the company's rice export offerings.",
  "frontend/src/pages/Products.tsx": "Products page displaying Basmati and Non-Basmati rice variants in a tabbed layout using ProductCard components, with a styled page header and a CTA section linking to the contact page.",
  "frontend/src/pages/QualityAssurance.tsx": "Quality Assurance page detailing lab testing steps, packaging features, and certifications for AZAD NEXUS rice exports, with a styled header and CTA linking to the contact page.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL query parameters (supporting both standard and hash-based routing), persist them in sessionStorage, and clean sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining brand color tokens (royal blue, gold, cream), custom fonts (Playfair Display, Inter), box shadows, border radii, and animation keyframes for the AZAD NEXUS site.",
  "project_state.json": "Project state manifest (version 3) describing the AZAD NEXUS B2B rice export website's architecture, design palette, implemented features, image requirements, and known issues."
}