{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "AZAD NEXUS — B2B Rice Export Website Frontend Implementation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Implement React Router with persistent navigation bar, five main pages (Home, Products, Quality Assurance, Global Footprint, Contact/Inquiry), and a prominent 'Request a Quote' CTA button in the navigation",
      "acceptanceCriteria": [
        "All five pages are accessible via navigation links",
        "Navigation bar is visible and responsive on all screen sizes",
        "'Request a Quote' CTA button scrolls to or navigates to the Contact/Inquiry page"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Set up React Router with routes for Home (/), Products (/products), Quality Assurance (/quality), Global Footprint (/global-footprint), Contact/Inquiry (/contact), and Admin (/admin). Wrap all routes with a persistent navigation layout component."
        },
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "create",
          "description": "Create a persistent navigation bar component containing the AZAD NEXUS logo (from frontend/public/assets/generated/azad-nexus-logo.dim_400x120.png), nav links to all five pages, and a 'Request a Quote' CTA button that navigates to /contact. Ensure responsive behavior for mobile screens."
        },
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "create",
          "description": "Create placeholder Home page component. Content will be implemented in REQ-3."
        },
        {
          "path": "frontend/src/pages/Products.tsx",
          "operation": "create",
          "description": "Create placeholder Products page component. Content will be implemented in REQ-4."
        },
        {
          "path": "frontend/src/pages/QualityAssurance.tsx",
          "operation": "create",
          "description": "Create placeholder Quality Assurance page component. Content will be implemented in REQ-5."
        },
        {
          "path": "frontend/src/pages/GlobalFootprint.tsx",
          "operation": "create",
          "description": "Create placeholder Global Footprint page component. Content will be implemented in REQ-6."
        },
        {
          "path": "frontend/src/pages/Contact.tsx",
          "operation": "create",
          "description": "Create placeholder Contact/Inquiry page component. Content will be implemented in REQ-7."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Apply premium minimalist corporate design theme with Deep Royal Blue (#0A1F5C) primary, Gold/Warm Amber (#C9A84C) accent, abundant white space, and professional typography consistently across all pages",
      "acceptanceCriteria": [
        "Royal Blue and Gold accent colors are applied consistently across all pages",
        "White space is generous and layout feels uncluttered and premium",
        "Typography hierarchy is clear with distinct heading and body styles"
      ],
      "file_operations": [
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Extend the Tailwind theme to include custom colors: primary (Deep Royal Blue #0A1F5C), accent (Gold/Warm Amber #C9A84C), and background off-white shades. Configure font families with a serif display font for headlines and sans-serif for body text."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Define global typography hierarchy using the configured Tailwind fonts. Set base styles for headings (h1-h6) with serif display font and body text with sans-serif. Apply generous spacing utilities and premium aesthetic defaults."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Build comprehensive Home page with hero section (using hero-split.dim_1920x1080.png), About Us summary, Featured Products slider, 'Why Choose Us' cards, and 'Direct from Farmers' section",
      "acceptanceCriteria": [
        "Hero section renders the split image as background with overlaid headline and CTAs",
        "About Us summary is present below the hero",
        "Featured products slider is functional and scrollable",
        "'Why Choose Us' shows three cards with distinct icons",
        "'Direct from Farmers' section is visually distinct and present on the page"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Implement full Home page structure with five sections: (1) Hero section with frontend/public/assets/generated/hero-split.dim_1920x1080.png as full-width background, headline 'Connecting India's Finest Harvest to the World', subheadline 'Premium Basmati & Non-Basmati Rice — Sourced Direct, Delivered Global', and dual CTAs ('Request a Quote' linking to /contact and 'Explore Products' linking to /products); (2) About Us summary (3-4 sentences about AZAD NEXUS as a trusted Indian rice exporter); (3) Featured Products horizontal slider component (will be created separately); (4) 'Why Choose Us' section with three cards (Timely Delivery, Competitive Pricing, Direct Sourcing) each with icon and description; (5) 'Direct from Farmers' section with paragraph and visual accent."
        },
        {
          "path": "frontend/src/components/FeaturedProductsSlider.tsx",
          "operation": "create",
          "description": "Create a horizontal slider component showcasing 3-4 key rice varieties (e.g., 1121 Basmati, Pusa Basmati, IR64, Parboiled). Each product card displays name, one-line description, and 'View Details' link to /products. Implement smooth scrolling behavior and navigation controls."
        },
        {
          "path": "frontend/src/components/WhyChooseUsCard.tsx",
          "operation": "create",
          "description": "Create a reusable card component for 'Why Choose Us' section. Props: icon, title, description. Apply premium styling consistent with the design theme."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Build Products page with two categories (Premium Basmati and Non-Basmati) using tabs or toggle, displaying six product varieties with name, description, and specs table (Grain Length, Moisture Content, Purity)",
      "acceptanceCriteria": [
        "Both Basmati and Non-Basmati categories are accessible via tabs or toggle",
        "Each product shows name, description, and a specs table with all three fields",
        "All six product varieties are present"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Products.tsx",
          "operation": "modify",
          "description": "Implement Products page with tab/toggle interface for two categories: Category A (Premium Basmati: 1121, Pusa, Steam) and Category B (Non-Basmati: Long Grain, IR64, Parboiled). Render product cards for each category. Use frontend/public/assets/generated/rice-texture.dim_1200x800.png as a decorative background accent in this section."
        },
        {
          "path": "frontend/src/components/ProductCard.tsx",
          "operation": "create",
          "description": "Create a product card component displaying product name, short description, and a specs table with three rows: Grain Length (mm), Moisture Content (%), and Purity (%). Apply premium card styling consistent with the design theme."
        },
        {
          "path": "frontend/src/data/products.ts",
          "operation": "create",
          "description": "Define static product data array with all six rice varieties, including name, description, grain length, moisture content, and purity percentage for each."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Build Quality Assurance page with three sections: Certifications (APEDA and ISO placeholder badges), Lab Testing process, and Packaging Standards descriptions",
      "acceptanceCriteria": [
        "APEDA and ISO placeholder badges are rendered as distinct visual cards",
        "Lab testing section clearly outlines the testing criteria",
        "Packaging standards section is present and readable"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/QualityAssurance.tsx",
          "operation": "modify",
          "description": "Implement Quality Assurance page with three sections: (1) Certifications — display two placeholder badge cards for APEDA Registration and ISO Certification, each with a logo placeholder slot and note that credentials will be updated; (2) Lab Testing — describe testing process (moisture, purity, grain sizing) in a visually structured layout (numbered steps or icon list); (3) Packaging Standards — describe export-grade packaging with moisture-control bags and labeling compliance."
        },
        {
          "path": "frontend/src/components/CertificationBadge.tsx",
          "operation": "create",
          "description": "Create a certification badge card component with props for certification name, logo placeholder slot, and description. Apply premium styling."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Build Global Footprint page/section with card/grid layout highlighting four export markets: Middle East, Europe, Southeast Asia, and Africa, each with region name, icon, and trade relationship description",
      "acceptanceCriteria": [
        "Four region cards are displayed in a responsive grid",
        "Each card has a region name, icon, and short description",
        "Section is accessible from the main navigation"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/GlobalFootprint.tsx",
          "operation": "modify",
          "description": "Implement Global Footprint page with a responsive grid layout showcasing four export markets: Middle East, Europe, Southeast Asia, and Africa. Each card displays the region name, a representative icon or flag cluster, and one line describing the trade relationship or key buyer type. Do not use interactive geolocation maps."
        },
        {
          "path": "frontend/src/components/RegionCard.tsx",
          "operation": "create",
          "description": "Create a region card component with props for region name, icon/flag cluster, and trade description. Apply premium styling consistent with the design theme."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Build Contact/Inquiry page with lead-generation form (Full Name, Company Name, Country, Rice Variety dropdown, Quantity in MT, optional Message) that calls the backend submitInquiry function and shows success confirmation",
      "acceptanceCriteria": [
        "All required fields are present and validated before submission",
        "Rice Variety is a dropdown with all six varieties",
        "Form calls backend on submit and shows a success message",
        "CTA button reads 'Request a Quote'"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Contact.tsx",
          "operation": "modify",
          "description": "Implement Contact/Inquiry page with a lead-generation form containing: Full Name (text, required), Company Name (text, required), Country (text or select, required), Rice Variety (select dropdown with options: 1121 Basmati, Pusa Basmati, Steam Basmati, Long Grain, IR64, Parboiled, required), Quantity in MT (number, required), and Message (textarea, optional). Form CTA button reads 'Request a Quote'. On submit, validate all required fields, call backend submitInquiry, and display a success confirmation message upon successful submission."
        },
        {
          "path": "frontend/src/hooks/useSubmitInquiry.ts",
          "operation": "create",
          "description": "Create a React Query mutation hook for submitting inquiries. Call backend submitInquiry function with form data. Handle loading, success, and error states. Return mutation handlers for form submission."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Build password-protected Admin Panel page at /admin that displays all submitted inquiries in a sortable table after authentication, with logout functionality",
      "acceptanceCriteria": [
        "Admin page at /admin shows a password gate before displaying data",
        "Incorrect password shows an error message",
        "Correct password reveals the inquiries table with all specified columns",
        "Timestamps are rendered in a human-readable format",
        "Logout button clears access and returns to the password screen"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Implement Admin Panel page at /admin. Use the authorization component to protect the page: require admin role access. If the user is not authenticated, prompt Internet Identity login. If authenticated but not admin, show an AccessDeniedScreen. If admin, fetch and display all submitted inquiries in a sortable table with columns: ID, Name, Company, Country, Rice Variety, Quantity (MT), Message, and Timestamp (formatted as human-readable date/time). Include a logout button that calls the authorization component's clear function and clears all cached data."
        },
        {
          "path": "frontend/src/hooks/useGetInquiries.ts",
          "operation": "create",
          "description": "Create a React Query hook for fetching inquiries. Call backend getInquiries function. Enable the query only when the user is an admin. Handle loading and error states."
        },
        {
          "path": "frontend/src/components/InquiriesTable.tsx",
          "operation": "create",
          "description": "Create a sortable table component for displaying inquiries. Columns: ID, Name, Company, Country, Rice Variety, Quantity (MT), Message, Timestamp. Implement column sorting functionality. Format timestamps as human-readable dates."
        },
        {
          "path": "frontend/src/components/AccessDeniedScreen.tsx",
          "operation": "create",
          "description": "Create an AccessDeniedScreen component to display when non-admin users attempt to access the admin panel. Show a clear message and provide a link to return to the home page."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the /admin route into the React Router configuration. Ensure the Admin page component is rendered at this route."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Add SEO-relevant meta tags to HTML head: page title, meta description with keywords, and Open Graph tags",
      "acceptanceCriteria": [
        "HTML title tag is set to the specified title",
        "Meta description contains the specified SEO keywords",
        "Open Graph meta tags are present"
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update HTML head section to include: page title 'AZAD NEXUS — Premium Basmati Rice Exporter from India', meta description tag containing keywords 'Premium Basmati Rice Exporter, Indian Rice Supplier, Bulk Rice Export', and Open Graph meta tags (og:title, og:description, og:image) for social sharing."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Wire all three generated images into the application: hero-split as Home hero background, rice-texture as Products decorative accent, and azad-nexus-logo in navbar and footer",
      "acceptanceCriteria": [
        "Hero image is used as the Home page hero background",
        "Rice texture image appears as a decorative accent in the appropriate section",
        "Logo appears in both the navbar and footer",
        "All image paths resolve correctly from frontend/public/assets/generated/"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Wire frontend/public/assets/generated/hero-split.dim_1920x1080.png as the full-width hero section background image. Ensure the image path resolves correctly and the hero section renders with proper overlay for text readability."
        },
        {
          "path": "frontend/src/pages/Products.tsx",
          "operation": "modify",
          "description": "Wire frontend/public/assets/generated/rice-texture.dim_1200x800.png as a decorative background accent in the Products page or product catalog section. Ensure the image path resolves correctly."
        },
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Wire frontend/public/assets/generated/azad-nexus-logo.dim_400x120.png into the navigation bar. Ensure the logo is clickable and links to the home page, and that the image path resolves correctly."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "create",
          "description": "Create a Footer component that includes frontend/public/assets/generated/azad-nexus-logo.dim_400x120.png, company contact information placeholder, and navigation links. Ensure the logo image path resolves correctly."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the Footer component into the application layout so it appears on all pages below the routed content."
        }
      ]
    }
  ]
}